#include "scan.h"

//0x28 bytes (sizeof)
struct _ISRDPCSTATS_SEQUENCE
{
    DWORD SequenceNumber;                                               //0x0
    QWORD IsrTime;                                                      //0x8
    QWORD IsrCount;                                                     //0x10
    QWORD DpcTime;                                                      //0x18
    QWORD DpcCount;                                                     //0x20
};

typedef struct _ISRDPCSTATS {
    QWORD IsrTime;                                                      //0x0
    QWORD IsrTimeStart;                                                 //0x8
    QWORD IsrCount;                                                     //0x10
    QWORD DpcTime;                                                      //0x18
    QWORD DpcTimeStart;                                                 //0x20
    QWORD DpcCount;                                                     //0x28
    UCHAR IsrActive;                                                    //0x30
    UCHAR Reserved[7];                                                  //0x31
    struct _ISRDPCSTATS_SEQUENCE DpcWatchdog;                           //0x38
} ISRDPCSTATS;

typedef struct {
	BYTE  bus,slot,func;
	config::Pci cfg;
	QWORD pci_device_object;
	QWORD drv_device_object;
} DEVICE_INFO;

typedef struct {
	unsigned char  blk;       // is port blocked
	unsigned char  blk_info;  // reason for blocking
	DEVICE_INFO    self;      // self data
	std::vector<DEVICE_INFO> devices;
} PORT_DEVICE_INFO;

namespace scan
{
	static void dumpcfg(std::vector<PORT_DEVICE_INFO> &devices);

	static void check_faceit(PORT_DEVICE_INFO &port);
	static void check_activity(PORT_DEVICE_INFO &port);
	static void check_driver(PORT_DEVICE_INFO &port);
	static void check_hidden(PORT_DEVICE_INFO &port);
	static void check_gummybear(BOOL advanced, PORT_DEVICE_INFO &port);
	static void check_config(PORT_DEVICE_INFO &port);
	static void check_features(PORT_DEVICE_INFO &port, std::vector<PNP_ADAPTER> &pnp_adapters);

	static void PrintPcieInfo(PORT_DEVICE_INFO& port);
